Autodesk.Revit.DB.KeyBasedTreeEntries.GetKeyBasedTreeEntriesIteratorInternal
Returns a KeyBasedTreeEntries iterator to a KeyBasedTreeEntries object.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntries.GetKeyBasedTreeEntriesIterator
Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
Returns: A KeyBasedTreeEntriesIterator object that can be used to iterate through KeyBasedTreeEntry objects in the collection.

Autodesk.Revit.DB.KeyBasedTreeEntries.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator( Autodesk::Revit::DB::KeyBasedTreeEntry^) object that can be used to iterate through KeyBasedTreeEntry objects in the collection.